library(readxl)
library(dplyr)
library(stringr)
library(tidyr)
library(writexl)

df <- read_excel("/Users/zelimkhan/Downloads/2024.02.20 IS_Task-69. СПГЗ с ОКПД2 из 878-ПП.xlsx", skip = 3)
df <- df[-1, ]
df <- df %>% select(- Пакет)

str(df)

colnames(df)
df <- df %>% fill('Идентификатор СПГЗ': 'Есть ПЦП')

df[, c('Идентификатор СПГЗ', 'Стандартизирована', 
       "Единицы измерения", 'Статус', 
       'Актуальна', 'Удалена', 'Есть ПЦП',
       'Единица измерения характеристики', 
       'Тип характеристики', 
       'Тип выбора значений характеристики заказчиком')] <- lapply(df[, c('Идентификатор СПГЗ', 'Стандартизирована', 
                                                                          "Единицы измерения", 'Статус', 
                                                                          'Актуальна', 'Удалена', 'Есть ПЦП',
                                                                          'Единица измерения характеристики', 
                                                                          'Тип характеристики', 
                                                                          'Тип выбора значений характеристики заказчиком')], as.factor)
df <- separate(df, "КПГЗ", 
         into = c("Код КПГЗ", 
                  "Наименование КПГЗ"),
         sep = "^\\S*\\K\\s+")
