remove(list = ls())
rm()

#### Packages and librarys ____________________________________________________________________________________________________ ####



#### Data preprocessing _______________________________________________________________________________________________________ ####

getwd()
setwd("C:/Users/GudievZK/Desktop/GitHub/DF/")
setwd("/Users/zelimkhan/Desktop/Data/GitHub/DF/")
df <- read.csv('grants.csv')
yt <- read.csv2("yt.csv")
# Чтобы корректно открыть в RStudio файл csv (без закорючек) необходимо:
# 1.	Для ОС Windows – при сохранении установить тип файла «CSV (разделитель -запятая)»
# 2.	Для ОС Mac – при сохранении установить тип файла «CSV UTF-8 (разделитель -запятая)»

#### Step 1,2: Contens  _______________________________________________________________________________________________________ ####
# В этом уроке мы научимся анализировать номинативные данные в R!
# Ссылка на скрипт урока: https://stepic.org/media/attachments/lesson/11502/categorical.R
# Ссылка на данные урока: https://stepic.org/media/attachments/lesson/11502/grants.csv



#### Step 3:Categorical data __________________________________________________________ ####

df <- read.csv("grants.csv")

str(df)


df$status <- as.factor(df$status)
levels(df$status) <- c("Not funded", "Funded")

df$status <- factor(df$status, labels = c("Not funded", "Funded"))


#### Step 3: 1d Table __________________________________________________________ ####
t1 <- table(df$status)
t1

dim(t1)

#### Step 3: yt (1d Table) __________________________________________________________ ####
table(yt$deputy)
table(yt$kind_tz)


#### Step 4: 2d Table __________________________________________________________ ####
t2 <- table(df$status, df$field)
t2
t2 <- table(status = df$status, field = df$field)

dim(t2)

prop.table(t2)

prop.table(t2, 1)
prop.table(t2, 2)

#### Step 4: yt (2d Table) __________________________________________________________ ####

yt_t1 <- table('Заместитель' = yt$deputy, 'Уровень наихудших КТД' = yt$top_worst_ktd)
yt_t1 <- as.data.frame(yt_t1)

dim(yt_t1)

prop.table(yt_t1, 1)
prop.table(yt_t1, 2)

# 
yt$ktd[yt$top_worst_ktd == '1']
yt$ktd[yt$top_worst_ktd == '2']

# Корректировка yt$deputy
yt$ktd[yt$deputy == '']
yt$teamleader[yt$ktd == "Поставка химических веществ"]
yt$teamleader[yt$ktd == "Поставка мебели детской и ученической"]
yt$teamleader[yt$ktd == "Поставка учебного оборудования для музыкального класса, закупаемого в рамках проекта «Техносфера современной школы»"]

yt$deputy[yt$deputy == ''] <- 'Чурсина Мария Вячеславовна'
yt$deputy[yt$ktd == ("Поставка химических веществ" | "Поставка мебели детской и ученической" 
  | "Поставка учебного оборудования для музыкального класса, закупаемого в рамках проекта «Техносфера современной школы»"] <- 'Чурсина Мария Вячеславовна'

yt$deputy[yt$ktd == 'Оказание услуг по техническому обслуживанию и текущему ремонту объектов коллекторного хозяйства'] <- 'Гудиев Зелимхан Куйраевич'



# ТРУ
yt$ktd[yt$ktd == "Разработка проектно-сметной документации на устройство сетей электроснабжения и электроосвещения"] <- "Выполнение работ по разработке проектно-сметной документации на устройство сетей электроснабжения и электроосвещения"

grep("Поставка", yt$ktd, value = T)
grep("Оказание", yt$ktd, value = T)
grep("Выполнение", yt$ktd, value = T)

yt$tru <- "Потавка товара"
yt$tru[grep("Оказание", yt$ktd, value = T)] <- "Оказание услуг"


for (i in 1:nrow(yt)) {
  if (grep("Поставка", yt$ktd[i], value = T)) {
    yt$tru[i] <- "Потавка товара"
  } else if (grep("Оказание", yt$ktd[i], value = T)) {
    yt$tru[i] <- "Оказание услуг"
  } else yt$tru[i] <- "Выполнение работ"
}



write.csv2(yt, "yt.csv")

#### Step 4: 3d Table __________________________________________________________ ####
t3 <- table(Years = df$years_in_uni, Field = df$field, Status = df$status)
t3

dim(t3)

#### Step 4: yt (3d Table) __________________________________________________________ ####

yt_t1 <- table('Заместитель' = yt$deputy, 'Уровень наихудших КТД' = yt$top_worst_ktd, 'Уровень наихудших КТД' = yt$top_worst_ktd)
yt_t1 <- as.data.frame(yt_t1)

dim(yt_t1)

prop.table(yt_t1, 1)
prop.table(yt_t1, 2)


#### Step 5: Exircises __________________________________________________________ ####

# К частям таблицы можно обращаться так же, как и к матрицам.
# HairEyeColor - таблица с данными, встроенными в R. Посмотрите на неё в R. Команда 
dimnames(HairEyeColor) 
# позволит нам посмотреть, какие измерения есть в этой таблице и как они называются. Например, чтобы обратиться к части таблицы, 
# в которой хранятся данные только о мужчинах, нам нужно выполнить следующую команду: 
HairEyeColor[ , ,'Male']
# Ваша задача в переменную red_men сохранить долю рыжеволосых (Red) от общего числа голубоглазых мужчин.
# Обратите внимание, что нужны не проценты, а просто доля, то есть десятичная дробь  (например, не 10%, а 0.1).
# Дополните код, чтобы получить верный ответ.        
red_men <- prop.table(HairEyeColor[, , "male"], 2)

#### plots __________________________________________________________ ####

barplot(t1)
barplot(t2)
barplot(t2, legend.text = TRUE, args.legend = list(x = "topright"))
barplot(t2, legend.text = TRUE, args.legend = list(x = "topright"), beside = TRUE)

mosaicplot(t2)


#### yt (plots) __________________________________________________________ ####


#### Binomial Test __________________________________________________________ ####

# 
binom.test(x = 5, n = 20, p = 0.5)
binom.test(t1)

#### yt (Binomial Test) __________________________________________________________ ####




#### Chi-Square __________________________________________________________ ####
t1
chisq.test(t1)

chi <- chisq.test(t1)
chi$exp
chi$obs


t2
chisq.test(t2)


#### yt (Chi-Square) __________________________________________________________ ####


#### Fisher's Exact Test __________________________________________________________ ####

fisher.test(t2)


#### yt (Fisher's Exact Test) __________________________________________________________ ####



  
  
  
