remove(list = ls())
rm()

#### 1 of 11 ####
# В этом уроке мы:
# В этом уроке мы
# 1) рассмотрим правила переписывания для векторов;
# 2) перечислим типы индексирования;
# 3) познакомимся с эффективными приёмами доступа и замены элементов вектора;
# 4) вместе решим несколько хитрых упражнений.

# Это ключевой урок на первой неделе: здесь я рассказываю о том, как сделать работу с векторами проще и приятнее. 
# А ещё здесь больше всего очков. Сюда можно возвращаться в течение всего курса за полезными функциями и примерами использования.
Recycling rules
?"+", ?Arithmetic, ?"["
?all, ?any
?which, ?which.min, ?which.max
?attributes
?sample, ?runif